# UnableToGenerateCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveByPointFailures..::..UnableToGenerateCurve Property
BuiltInFailures..::..CurveByPointFailures Class See Also
---
Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToGenerateCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToGenerateCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToGenerateCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurveByPointFailures Class
Autodesk.Revit.DB Namespace